NordicPlayground/nRF51-ble-bcast-mesh/rbc_database.c
#include "rbc_database.h"
#include "rebroadcast.h"
#include "timeslot_handler.h"
#include "trickle.h"

#include "nrf_error.h"
#include "ble.h"

#include <stdlib.h>
#include <stdbool.h>
#include <string.h>

/* Packet related constants */
#define MESH_PACKET_HANDLE_LEN          (1)
#define MESH_PACKET_VERSION_LEN         (2)

#define MESH_PACKET_HANDLE_OFFSET       (0)
#define MESH_PACKET_VERSION_OFFSET      (MESH_PACKET_HANDLE_OFFSET + MESH_PACKET_HANDLE_LEN)
#define MESH_PACKET_DATA_OFFSET         (MESH_PACKET_VERSION_OFFSET + MESH_PACKET_VERSION_LEN)
/*****************************************************************************
* Local Type Definitions
*****************************************************************************/

typedef struct
{
    uint8_t value_count;
    mesh_char_metadata_t* char_metadata;
    uint16_t service_handle;
    ble_gatts_char_handles_t ble_md_char_handles;
} mesh_srv_t;



/*****************************************************************************
* Static globals
*****************************************************************************/
static mesh_srv_t g_mesh_service = {0, NULL, 0};

static const ble_uuid128_t mesh_base_uuid = {0x1E, 0xCD, 0x00, 0x00, 
                                            0x8C, 0xB9, 0xA8, 0x8B,
                                            0x82, 0xD8, 0x51, 0xFD,
                                            0xA1, 0x77, 0x1E, 0x2A};
static uint8_t mesh_base_uuid_type;

static bool is_initialized = false;

/*****************************************************************************
* Static functions
*****************************************************************************/

static uint32_t mesh_md_char_add(mesh_metadata_char_t* metadata)
{    
    /**@TODO: put ranges in public #defines */
    if (metadata->mesh_channel > 39 || 
        metadata->mesh_adv_int_ms < 5 || 
        metadata->mesh_adv_int_ms > 60000)
    {
        return NRF_ERROR_INVALID_PARAM;
    }
    
    /* cccd for metadata char */
    ble_gatts_attr_md_t cccd_md;
    
    memset(&cccd_md, 0, sizeof(cccd_md));
    
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.write_perm);
    cccd_md.vloc = BLE_GATTS_VLOC_STACK;
    
    /* metadata char */
    ble_gatts_char_md_t ble_char_md;
        
    memset(&ble_char_md, 0, sizeof(ble_char_md));
    
    ble_char_md.char_props.read = 1;
    ble_char_md.char_props.notify = 1;
    
    ble_char_md.p_char_pf = NULL;
    ble_char_md.p_cccd_md = &cccd_md;
    ble_char_md.p_char_user_desc = NULL;
    ble_char_md.p_user_desc_md = NULL;
    
    /* ATT metadata */
    ble_gatts_attr_md_t ble_attr_md;
    
    memset(&ble_attr_md, 0, sizeof(ble_attr_md));
    
    ble_attr_md.read_perm.lv = 1;
    ble_attr_md.read_perm.sm = 1;
    ble_attr_md.write_perm.lv = 1;
    ble_attr_md.write_perm.sm = 1;
    
    ble_attr_md.rd_auth = 0;
    ble_attr_md.wr_auth = 0;
    ble_attr_md.vlen = 0;
    ble_attr_md.vloc = BLE_GATTS_VLOC_STACK;
    
    /* ble characteristic UUID */
    ble_uuid_t ble_uuid;
    
    ble_uuid.type = mesh_base_uuid_type;
    ble_uuid.uuid = MESH_MD_CHAR_UUID;
    
    /* metadata contents */
    uint8_t value_array[9];
    
    memcpy(&value_array[MESH_MD_CHAR_AA_OFFSET], 
        &metadata->mesh_access_addr, 
        sizeof(metadata->mesh_access_addr));
    
    memcpy(&value_array[MESH_MD_CHAR_ADV_INT_OFFSET], 
        &metadata->mesh_adv_int_ms, 
        sizeof(metadata->mesh_adv_int_ms));
        
    memcpy(&value_array[MESH_MD_CHAR_COUNT_OFFSET], 
        &metadata->mesh_value_count, 
        sizeof(metadata->mesh_value_count));
    
    memcpy(&value_array[MESH_MD_CHAR_CH_OFFSET], 
        &metadata->mesh_channel, 
        sizeof(metadata->mesh_channel));
    
    
    /* ble attribute */
    ble_gatts_attr_t ble_attr;
    
    memset(&ble_attr, 0, sizeof(ble_attr));
    
    ble_attr.init_len = 9;
    ble_attr.init_offs = 0;
    ble_attr.max_len = 9;
    ble_attr.p_uuid = &ble_uuid;
    ble_attr.p_value = value_array;
    ble_attr.p_attr_md = &ble_attr_md;
    
    /* add characteristic */    
    uint32_t error_code = sd_ble_gatts_characteristic_add(
        g_mesh_service.service_handle,
        &ble_char_md,
        &ble_attr, 
        &g_mesh_service.ble_md_char_handles);
        
    if (error_code != NRF_SUCCESS)
    {
        return error_code;
    }
    
    
    
    return NRF_SUCCESS;
}

static uint32_t mesh_value_char_add(uint8_t index)
{
    if (index >= MAX_VALUE_COUNT)
    {
        return NRF_ERROR_INVALID_PARAM;
    }
    
    /* metadata presentation format */
    ble_gatts_char_pf_t ble_char_pf;
    
    memset(&ble_char_pf, 0, sizeof(ble_char_pf));
    
    ble_char_pf.name_space = BLE_GATT_CPF_NAMESPACE_BTSIG;
    ble_char_pf.exponent = 0;
    ble_char_pf.format = BLE_GATT_CPF_FORMAT_UINT8;
    ble_char_pf.desc = index; /* identical to trickle instance id */
    
    
    /* BLE GATT metadata */
    ble_gatts_char_md_t ble_char_md;
    
    memset(&ble_char_md, 0, sizeof(ble_char_md));
    
    ble_char_md.p_char_pf = &ble_char_pf;
    ble_char_md.char_props.read = 1;
    ble_char_md.char_props.write = 1;
    ble_char_md.char_props.notify = 1;
    
    ble_char_md.p_cccd_md = NULL;
    ble_char_md.p_sccd_md = NULL;
    ble_char_md.p_char_user_desc = NULL;
    ble_char_md.p_user_desc_md = NULL;
    
    /* ATT metadata */
    
    ble_gatts_attr_md_t ble_attr_md;
    
    memset(&ble_attr_md, 0, sizeof(ble_attr_md));
    
    /* No security is required whatsoever, needs to be changed when encryption
        is added */
    ble_attr_md.read_perm.lv = 1;
    ble_attr_md.read_perm.sm = 1;
    ble_attr_md.write_perm.lv = 1;
    ble_attr_md.write_perm.sm = 1;
    
    ble_attr_md.vloc = BLE_GATTS_VLOC_STACK;
    ble_attr_md.rd_auth = 0;
    ble_attr_md.wr_auth = 0;
    ble_attr_md.vlen = 1;
    
    /* ble characteristic UUID */
    ble_uuid_t ble_uuid;
    
    ble_uuid.type = mesh_base_uuid_type;
    ble_uuid.uuid = MESH_VALUE_CHAR_UUID;
    
    /* ble attribute */
    ble_gatts_attr_t ble_attr;
    uint8_t default_value = 0;
    
    memset(&ble_attr, 0, sizeof(ble_attr));
    
    ble_attr.init_len = 1;
    ble_attr.init_offs = 0;
    ble_attr.max_len = MAX_VALUE_LENGTH;
    ble_attr.p_attr_md = &ble_attr_md;
    ble_attr.p_uuid = &ble_uuid;
    ble_attr.p_value = &default_value;
    
    
    /* add to service */
    ble_gatts_char_handles_t ble_value_char_handles;
    
    uint32_t error_code = sd_ble_gatts_characteristic_add(
        g_mesh_service.service_handle, 
        &ble_char_md, 
        &ble_attr, 
        &ble_value_char_handles);
        
    if (error_code != NRF_SUCCESS)
    {
        return error_code;
    }
    
    g_mesh_service.char_metadata[index].char_value_handle =  ble_value_char_handles.value_handle;
    
    return NRF_SUCCESS;
}

/*****************************************************************************
* Interface functions
*****************************************************************************/

uint32_t mesh_srv_init(uint8_t mesh_value_count, 
    uint32_t access_address, uint8_t channel, uint32_t adv_int_ms)
{
    if (mesh_value_count > MAX_VALUE_COUNT)
    {
        return NRF_ERROR_INVALID_PARAM;
    }
    
    if (is_initialized)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    
    is_initialized = true;
    
    
    g_mesh_service.value_count = mesh_value_count;
    
    ble_uuid_t ble_srv_uuid;
    
    /* add the mesh base UUID */
    
    sd_ble_uuid_vs_add(&mesh_base_uuid, &mesh_base_uuid_type);
    
    uint32_t error_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY, 
        &ble_srv_uuid, &g_mesh_service.service_handle);
    
    if (error_code != NRF_SUCCESS)
    {
        return error_code;
    }
    
    /* Add metadata characteristic */
    mesh_metadata_char_t mesh_metadata;
    mesh_metadata.mesh_access_addr = access_address;
    mesh_metadata.mesh_adv_int_ms = adv_int_ms;
    mesh_metadata.mesh_channel = channel;
    mesh_metadata.mesh_value_count = mesh_value_count;
    
    mesh_md_char_add(&mesh_metadata);
    
    uint32_t md_len = sizeof(mesh_char_metadata_t) * g_mesh_service.value_count;
    
    /* allocate metadata array */
    g_mesh_service.char_metadata = (mesh_char_metadata_t*) malloc(md_len);    
    memset(g_mesh_service.char_metadata, 0, md_len);
    
    /* add characteristics to mesh service */
    for (uint8_t i = 0; i < g_mesh_service.value_count; ++i)
    {
        error_code = mesh_value_char_add(i);
        
        if (error_code != NRF_SUCCESS)
        {
            return error_code;
        }   
    }
    
    
    return NRF_SUCCESS;
}


uint32_t mesh_srv_char_val_set(uint8_t index, uint8_t* data, uint16_t len)
{
    if (!is_initialized)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    
    if (index >= g_mesh_service.value_count)
    {
        return NRF_ERROR_INVALID_ADDR;
    }
    
    if (len > MAX_VALUE_LENGTH)
    {
        return NRF_ERROR_INVALID_LENGTH;
    }
    
    uint32_t error_code = sd_ble_gatts_value_set(
        g_mesh_service.char_metadata[index].char_value_handle, 
        0, &len, data);
    
    if (error_code != NRF_SUCCESS)
    {
        return error_code;
    }
    
    return NRF_SUCCESS;
}

uint32_t mesh_srv_char_val_get(uint8_t index, uint8_t* data, uint16_t* len)
{
    if (!is_initialized)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    
    if (index >= g_mesh_service.value_count)
    {
        return NRF_ERROR_INVALID_ADDR;
    }
    
    uint32_t error_code = sd_ble_gatts_value_get(
        g_mesh_service.char_metadata[index].char_value_handle, 
        0, len, data);
    
    if (error_code != NRF_SUCCESS)
    {
        return error_code;
    }
    
    return NRF_SUCCESS;
}

uint32_t mesh_srv_char_md_get(mesh_metadata_char_t* metadata)
{
    if (!is_initialized)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    
    uint8_t data_array[MESH_MD_CHAR_LEN];
    uint16_t len = MESH_MD_CHAR_LEN;
    
    uint32_t error_code = sd_ble_gatts_value_get(
        g_mesh_service.ble_md_char_handles.value_handle, 0, &len, data_array);
    
    if (error_code != NRF_SUCCESS)
    {
        return error_code;
    }
    
    if (len != MESH_MD_CHAR_LEN)
    {
        return NRF_ERROR_INTERNAL;
    }
    
    memcpy(&metadata->mesh_access_addr, 
        &data_array[MESH_MD_CHAR_AA_OFFSET],
        sizeof(metadata->mesh_access_addr));
    
    memcpy(&metadata->mesh_adv_int_ms, 
        &data_array[MESH_MD_CHAR_ADV_INT_OFFSET],
        sizeof(metadata->mesh_adv_int_ms));
    
    memcpy(&metadata->mesh_channel, 
        &data_array[MESH_MD_CHAR_CH_OFFSET],
        sizeof(metadata->mesh_channel));
    
    memcpy(&metadata->mesh_value_count, 
        &data_array[MESH_MD_CHAR_COUNT_OFFSET],
        sizeof(metadata->mesh_value_count));
    
    return NRF_SUCCESS;
}

uint32_t mesh_srv_get_next_processing_time(uint32_t* time)
{
    if (!is_initialized)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    
    *time = UINT32_MAX / 1000;
    
    for (uint8_t i = 0; i < g_mesh_service.value_count; ++i)
    {
        if ((g_mesh_service.char_metadata[i].flags & (1 << MESH_MD_FLAGS_USED_POS)) == 0)
            continue;
            
        uint32_t temp_time = trickle_next_processing_get(&g_mesh_service.char_metadata[i].trickle);
        
        if (temp_time < *time)
        {
            *time = temp_time;
        }
    }
        
    return NRF_SUCCESS;
}

uint32_t mesh_srv_packet_process(packet_t* packet)
{
    if (!is_initialized)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    uint32_t error_code;
    
    uint8_t handle = packet->data[MESH_PACKET_HANDLE_OFFSET];
    uint16_t version = (packet->data[MESH_PACKET_VERSION_OFFSET] | 
                    (((uint16_t) packet->data[MESH_PACKET_VERSION_OFFSET + 1]) << 8));
    uint8_t* data = &packet->data[MESH_PACKET_DATA_OFFSET];
    uint16_t data_len = packet->length - MESH_PACKET_DATA_OFFSET;
    
    if (data_len > MAX_VALUE_LENGTH)
    {
        return NRF_ERROR_INVALID_LENGTH;
    }
    
    if (handle >= g_mesh_service.value_count)
    {
        return NRF_ERROR_INVALID_ADDR;
    }
    
    
    mesh_char_metadata_t* ch_md = &g_mesh_service.char_metadata[handle];
    
    if (version != ch_md->version_number)
    {
        trickle_rx_inconsistent(&ch_md->trickle);
    }
    
    /* new version */
    /**@TODO: Handle version overflow */
    if (version > ch_md->version_number)
    {
        bool uninitialized = !(ch_md->flags & (1 << MESH_MD_FLAGS_INITIALIZED_POS));
        
        /* update value */
        memcpy(&ch_md->last_sender_addr, &packet->sender, sizeof(ble_gap_addr_t));
        ch_md->version_number = version;
        mesh_srv_char_val_set(handle, data, data_len);
        ch_md->flags |= (1 << MESH_MD_FLAGS_INITIALIZED_POS) |
                        (1 << MESH_MD_FLAGS_USED_POS);
        
        /* Propagate to application space */
        uint8_t data_copy[MAX_VALUE_LENGTH]; /* use heap instead? */
        memcpy(data_copy, data, data_len);
        
        rbc_event_t update_evt;
        update_evt.event_type = ((uninitialized)? 
            RBC_EVENT_TYPE_NEW_VAL :
            RBC_EVENT_TYPE_UPDATE_VAL);
        update_evt.data = data_copy;
        update_evt.data_len = data_len;
        update_evt.value_handle = handle;
        
        /**@TODO: Handle in different context? */
        rbc_event_handler(&update_evt);
    }
    else if (version == ch_md->version_number)
    {
        /* check for conflicting data */
        /**@TODO: use hash or checksum or something? 
            This is SLOW and happens very often */
        uint8_t old_data[MAX_VALUE_LENGTH];
        uint16_t old_len = MAX_VALUE_LENGTH;
        
        
        error_code = mesh_srv_char_val_get(handle, old_data, &old_len);
        if (error_code != NRF_SUCCESS)
        {
            return error_code;
        }
        
        bool conflicting = false;
        
        if (old_len != data_len)
        {
            conflicting = true;
        }
        else if (memcmp(old_data, data, data_len) != 0)
        {
            conflicting = true;
        }
        
        if (conflicting)
        {
            rbc_event_t conflicting_evt;
            uint8_t data_copy[MAX_VALUE_LENGTH]; /* use heap instead? */
            memcpy(data_copy, data, data_len);
            
            conflicting_evt.event_type = RBC_EVENT_TYPE_CONFLICTING_VAL;
            conflicting_evt.data = data_copy;
            conflicting_evt.data_len = data_len;
            conflicting_evt.value_handle = handle;
            
            trickle_rx_inconsistent(&ch_md->trickle);
            
            /**@TODO: Handle in different context? */
            rbc_event_handler(&conflicting_evt);
        }
        else
        {
            trickle_rx_consistent(&ch_md->trickle);
        }
        
    }
}


uint32_t mesh_srv_packet_assemble(packet_t* packet, 
    uint16_t packet_max_len, 
    bool* has_anything_to_send)
{
    *has_anything_to_send = false;
    if (!is_initialized)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    uint32_t error_code;
    
    for (uint8_t i = 0; i < g_mesh_service.value_count; ++i)
    {
        mesh_char_metadata_t* md_ch = &g_mesh_service.char_metadata[i];
        trickle_step(md_ch->trickle, has_anything_to_send);

        if (has_anything_to_send)
        {
            uint8_t data[MAX_VALUE_LENGTH];
            uint16_t len = MAX_VALUE_LEN;

            error_code = mesh_srv_char_val_get(i, data, &len);

            if (error_code != NRF_SUCCESS)
            {
                return error_code;
            }

            packet->data[MESH_PACKET_HANDLE_OFFSET] = i;
            packet->data[MESH_PACKET_VERISON_OFFSET] = 
                (md_ch->version_number & 0xFF); 
            packet->data[MESH_PACKET_VERSION_OFFSET + 1] = 
                ((md_ch->version_number >> 8) & 0xFF);
          
            memcpy(&packet->data[MESH_PACKET_DATA_OFFSET], data, len);

            /**@TODO: Add multiple trickle messages in one packet */

            break;
        }
    }
}


